; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_4 ?v11 ?v13)
             (pred_10 ?v5 ?v1)
             (pred_8 ?v11 ?v1)
             (pred_12 ?v9 ?v11 )
	     (pred_1 ?v11)
             (pred_7 ?v12)
             (pred_9 ?v5)
             (pred_2 ?v1)
             (pred_6 ?v11)
             (pred_11 ?v5)
             (pred_3 ?v11)
             (pred_5 ))



(:action op_1
:parameters (?v2 ?v6 ?v7 ?v10)
:precondition (and (pred_7 ?v2) (pred_7 ?v6) (pred_9 ?v7) (pred_2 ?v10)
          (pred_4 ?v2 ?v6) (pred_10 ?v7 ?v10)
                   (pred_8 ?v6 ?v10) (pred_1 ?v2) 
                   (pred_6 ?v6) (pred_11 ?v7))
:effect (and  (pred_3 ?v6) (not (pred_6 ?v6))))


(:action op_4
:parameters (?v2 ?v3)
:precondition (and (pred_7 ?v2) (pred_7 ?v3)
               (pred_1 ?v2) (pred_4 ?v2 ?v3) (pred_3 ?v3))
:effect (and (pred_1 ?v3) (not (pred_1 ?v2))))

(:action op_5
:parameters (?v2 ?v7)
:precondition (and (pred_7 ?v2) (pred_9 ?v7) 
                  (pred_1 ?v2) (pred_12 ?v7 ?v2) (pred_5 ))
:effect (and (pred_11 ?v7)
   (not (pred_12 ?v7 ?v2)) (not (pred_5 ))))


(:action op_2
:parameters (?v2 ?v8 ?v4)
:precondition (and (pred_7 ?v2) (pred_9 ?v8) (pred_9 ?v4)
                  (pred_1 ?v2) (pred_11 ?v4) (pred_12 ?v8 ?v2))
:effect (and (pred_11 ?v8) (pred_12 ?v4 ?v2)
        (not (pred_11 ?v4)) (not (pred_12 ?v8 ?v2))))

(:action op_3
:parameters (?v2 ?v7)
:precondition (and (pred_7 ?v2) (pred_9 ?v7) 
                  (pred_1 ?v2) (pred_11 ?v7))
:effect (and (pred_5 ) (pred_12 ?v7 ?v2) (not (pred_11 ?v7)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_10 obj_12 obj_11 obj_24 obj_28 obj_15 obj_14 obj_23 obj_27 obj_01 obj_22 obj_05 obj_25 obj_19 obj_17 obj_04 obj_18 obj_26 obj_06 obj_02 obj_30 obj_29 obj_21 obj_13 obj_32
    obj_31 obj_07 obj_03
    obj_20 obj_09 obj_08 obj_16
    )

    (:init
       (pred_5)

       (pred_7 obj_10)
       (pred_7 obj_12)
       (pred_7 obj_11)
       (pred_7 obj_24)
       (pred_7 obj_28)
       (pred_7 obj_15)
       (pred_7 obj_14)
       (pred_7 obj_23)
       (pred_7 obj_27)
       (pred_7 obj_01)
       (pred_7 obj_22)
       (pred_7 obj_05)
       (pred_7 obj_25)
       (pred_7 obj_19)
       (pred_7 obj_17)
       (pred_7 obj_04)
       (pred_7 obj_18)
       (pred_7 obj_26)
       (pred_7 obj_06)
       (pred_7 obj_02)
       (pred_7 obj_30)
       (pred_7 obj_29)
       (pred_7 obj_21)
       (pred_7 obj_13)
       (pred_7 obj_32)
       (pred_2 obj_31)
       (pred_2 obj_07)
       (pred_2 obj_03)
       (pred_9 obj_20)
       (pred_9 obj_09)
       (pred_9 obj_08)
       (pred_9 obj_16)

       (pred_4 obj_10 obj_15)
       (pred_4 obj_10 obj_12)
       (pred_4 obj_12 obj_14)
       (pred_4 obj_12 obj_11)
       (pred_4 obj_12 obj_10)
       (pred_4 obj_11 obj_23)
       (pred_4 obj_11 obj_24)
       (pred_4 obj_11 obj_12)
       (pred_4 obj_24 obj_27)
       (pred_4 obj_24 obj_28)
       (pred_4 obj_24 obj_11)
       (pred_4 obj_28 obj_01)
       (pred_4 obj_28 obj_24)
       (pred_4 obj_15 obj_22)
       (pred_4 obj_15 obj_14)
       (pred_4 obj_15 obj_10)
       (pred_4 obj_14 obj_05)
       (pred_4 obj_14 obj_23)
       (pred_4 obj_14 obj_12)
       (pred_4 obj_14 obj_15)
       (pred_4 obj_23 obj_25)
       (pred_4 obj_23 obj_27)
       (pred_4 obj_23 obj_11)
       (pred_4 obj_23 obj_14)
       (pred_4 obj_27 obj_19)
       (pred_4 obj_27 obj_01)
       (pred_4 obj_27 obj_24)
       (pred_4 obj_27 obj_23)
       (pred_4 obj_01 obj_17)
       (pred_4 obj_01 obj_28)
       (pred_4 obj_01 obj_27)
       (pred_4 obj_22 obj_04)
       (pred_4 obj_22 obj_05)
       (pred_4 obj_22 obj_15)
       (pred_4 obj_05 obj_18)
       (pred_4 obj_05 obj_25)
       (pred_4 obj_05 obj_14)
       (pred_4 obj_05 obj_22)
       (pred_4 obj_25 obj_26)
       (pred_4 obj_25 obj_19)
       (pred_4 obj_25 obj_23)
       (pred_4 obj_25 obj_05)
       (pred_4 obj_19 obj_06)
       (pred_4 obj_19 obj_17)
       (pred_4 obj_19 obj_27)
       (pred_4 obj_19 obj_25)
       (pred_4 obj_17 obj_02)
       (pred_4 obj_17 obj_01)
       (pred_4 obj_17 obj_19)
       (pred_4 obj_04 obj_30)
       (pred_4 obj_04 obj_18)
       (pred_4 obj_04 obj_22)
       (pred_4 obj_18 obj_29)
       (pred_4 obj_18 obj_26)
       (pred_4 obj_18 obj_05)
       (pred_4 obj_18 obj_04)
       (pred_4 obj_26 obj_21)
       (pred_4 obj_26 obj_06)
       (pred_4 obj_26 obj_25)
       (pred_4 obj_26 obj_18)
       (pred_4 obj_06 obj_13)
       (pred_4 obj_06 obj_02)
       (pred_4 obj_06 obj_19)
       (pred_4 obj_06 obj_26)
       (pred_4 obj_02 obj_32)
       (pred_4 obj_02 obj_17)
       (pred_4 obj_02 obj_06)
       (pred_4 obj_30 obj_29)
       (pred_4 obj_30 obj_04)
       (pred_4 obj_29 obj_21)
       (pred_4 obj_29 obj_18)
       (pred_4 obj_29 obj_30)
       (pred_4 obj_21 obj_13)
       (pred_4 obj_21 obj_26)
       (pred_4 obj_21 obj_29)
       (pred_4 obj_13 obj_32)
       (pred_4 obj_13 obj_06)
       (pred_4 obj_13 obj_21)
       (pred_4 obj_32 obj_02)
       (pred_4 obj_32 obj_13)
       (pred_6 obj_01)
       (pred_6 obj_26)
       (pred_6 obj_18)
       (pred_6 obj_21)
       (pred_8  obj_01 obj_31)
       (pred_8  obj_26 obj_07)
       (pred_8  obj_18 obj_03)
       (pred_8  obj_21 obj_03)
       (pred_3 obj_10)
       (pred_3 obj_12)
       (pred_3 obj_11)
       (pred_3 obj_24)
       (pred_3 obj_28)
       (pred_3 obj_15)
       (pred_3 obj_14)
       (pred_3 obj_23)
       (pred_3 obj_27)
       (pred_3 obj_22)
       (pred_3 obj_05)
       (pred_3 obj_25)
       (pred_3 obj_19)
       (pred_3 obj_17)
       (pred_3 obj_04)
       (pred_3 obj_06)
       (pred_3 obj_02)
       (pred_3 obj_30)
       (pred_3 obj_29)
       (pred_3 obj_13)
       (pred_3 obj_32)

       (pred_10  obj_20 obj_31)
       (pred_10  obj_09 obj_07)
       (pred_10  obj_08 obj_03)
       (pred_10  obj_16 obj_03)
       (pred_12 obj_20 obj_23)
       (pred_12 obj_09 obj_04)
       (pred_12 obj_08 obj_13)
       (pred_12 obj_16 obj_10)
       (pred_1 obj_13)
    )

    (:goal (and
       (pred_12 obj_16 obj_05)
    ))
(:constraints
  (always (not (pred_1 obj_14)))
)
)

; plan
1. (op_4 obj_13 obj_06)
   deleted: (pred_1 obj_13)
   added: (pred_1 obj_06)
   goals met: 0 of 1
2. (op_4 obj_06 obj_19)
   deleted: (pred_1 obj_06)
   added: (pred_1 obj_19)
   goals met: 0 of 1
3. (op_4 obj_19 obj_25)
   deleted: (pred_1 obj_19)
   added: (pred_1 obj_25)
   goals met: 0 of 1
4. (op_4 obj_25 obj_05)
   deleted: (pred_1 obj_25)
   added: (pred_1 obj_05)
   goals met: 0 of 1
5. (op_4 obj_05 obj_22)
   deleted: (pred_1 obj_05)
   added: (pred_1 obj_22)
   goals met: 0 of 1
6. (op_4 obj_22 obj_15)
   deleted: (pred_1 obj_22)
   added: (pred_1 obj_15)
   goals met: 0 of 1
7. (op_4 obj_15 obj_10)
   deleted: (pred_1 obj_15)
   added: (pred_1 obj_10)
   goals met: 0 of 1
8. (op_5 obj_10 obj_16)
   deleted: (pred_12 obj_16 obj_10) (pred_5)
   added: (pred_11 obj_16)
   goals met: 0 of 1
9. (op_4 obj_10 obj_15)
   deleted: (pred_1 obj_10)
   added: (pred_1 obj_15)
   goals met: 0 of 1
10. (op_4 obj_15 obj_22)
   deleted: (pred_1 obj_15)
   added: (pred_1 obj_22)
   goals met: 0 of 1
11. (op_4 obj_22 obj_05)
   deleted: (pred_1 obj_22)
   added: (pred_1 obj_05)
   goals met: 0 of 1
12. (op_3 obj_05 obj_16)
   deleted: (pred_11 obj_16)
   added: (pred_5) (pred_12 obj_16 obj_05)
   goals met: 1 of 1
